Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_ckcu.c
/*********************************************************************************************************//**
 * @file    ht32f12365_66_ckcu.c
 * @version $Rev:: 103          $
 * @date    $Date:: 2016-03-07 #$
 * @brief   This file provides all the Clock Control Unit firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f12365_66_ckcu.h"

/** @addtogroup HT32F12365_66_Peripheral_Driver HT32F12365/12366 Peripheral Driver
  * @{
  */

/** @defgroup CKCU CKCU
  * @brief CKCU driver modules
  * @{
  */


/* Private definitions -------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Define CKCU private definitions
  * @{
  */

/* GCFGR bit field definition                                                                               */
#define CKCU_POS_CKOUTSRC       0
#define CKCU_MASK_CKOUTSRC      ((u32)0x7 << CKCU_POS_CKOUTSRC)

#define CKCU_POS_CKREFPRE       11
#define CKCU_MASK_CKREFPRE      ((u32)0x1F << CKCU_POS_CKREFPRE)

#define CKCU_POS_USBPRE         22
#define CKCU_MASK_USBPRE        ((u32)0x3 << CKCU_POS_USBPRE)

/* GCCR bit field definition                                                                                */
#define CKCU_POS_SW             0
#define CKCU_MASK_SW            ((u32)0x3 << CKCU_POS_SW)

/* PLLCFGR bit field definition                                                                             */
#define CKCU_POS_POTD           21
#define CKCU_MASK_POTD          ((u32)0x3 << CKCU_POS_POTD)

#define CKCU_POS_PFBD           23
#define CKCU_MASK_PFBD          ((u32)0x3F << CKCU_POS_PFBD)

/* APBCFGR bit field definition                                                                             */
#define CKCU_POS_ADCDIV         16
#define CKCU_MASK_ADCDIV        ((u32)0x7 << CKCU_POS_ADCDIV)

/* CKST bit field definition                                                                                */
#define CKCU_POS_PLLST          8
#define CKCU_MASK_PLLST         ((u32)0xF << CKCU_POS_PLLST)

#define CKCU_POS_HSEST          16
#define CKCU_MASK_HSEST         ((u32)0x3 << CKCU_POS_HSEST)

#define CKCU_POS_HSIST          24
#define CKCU_MASK_HSIST         ((u32)0x7 << CKCU_POS_HSIST)

#ifdef HT32F12366_D11
#define CKCU_POS_CKSWST         30
#define CKCU_MASK_CKSWST        ((u32)0x3 << CKCU_POS_CKSWST)
#else
#define CKCU_POS_CKSWST         0
#define CKCU_MASK_CKSWST        ((u32)0x7 << CKCU_POS_CKSWST)
#endif

/* GCFGR Bit Band Alias                                                                                     */
#define CKCU_BB_PLLSRC          BitBand((u32)&HT_CKCU->GCFGR, 8)

/* GCCR Bit Band Alias                                                                                      */
#define CKCU_BB_PLLEN           BitBand((u32)&HT_CKCU->GCCR, 9)
#define CKCU_BB_HSEEN           BitBand((u32)&HT_CKCU->GCCR, 10)
#define CKCU_BB_HSIEN           BitBand((u32)&HT_CKCU->GCCR, 11)
#define CKCU_BB_CKMEN           BitBand((u32)&HT_CKCU->GCCR, 16)
#define CKCU_BB_PSRCEN          BitBand((u32)&HT_CKCU->GCCR, 17)

/* GCIR Bit Band Alias                                                                                      */
#define CKCU_BB_CKSF            BitBand((u32)&HT_CKCU->GCIR, 0)
#define CKCU_BB_CKSIE           BitBand((u32)&HT_CKCU->GCIR, 16)

/* PLLCR Bit Band Alias                                                                                     */
#define CKCU_BB_PLLBYPASS       BitBand((u32)&HT_CKCU->PLLCR, 31)

/* LPCR Bit Band Alias                                                                                      */
#define CKCU_BB_BKISO           BitBand((u32)&HT_CKCU->LPCR, 0)

/* HSICR Bit Band Alias                                                                                     */
#define CKCU_BB_TRIMEN          BitBand((u32)&HT_CKCU->HSICR, 0)
#define CKCU_BB_ATCEN           BitBand((u32)&HT_CKCU->HSICR, 1)
#define CKCU_BB_REFCLKSEL       BitBand((u32)&HT_CKCU->HSICR, 5)

/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Macro CKCU private macros
  * @{
  */
#define CKCU_BF_WRITE(Reg, Mask, Pos, WriteValue)   (Reg = ((Reg & ~((u32)Mask)) | ((u32)WriteValue << Pos)))
#define CKCU_BF_READ(Reg, Mask, Pos)                ((Reg & (u32)Mask) >> Pos)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief  Deinitialize the CKCU registers to the reset values.
 * @retval None
 ************************************************************************************************************/
void CKCU_DeInit(void)
{
  /* Reset system clock                                                                                     */
  CKCU_HSICmd(ENABLE);
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSIRDY) == RESET);
  CKCU_SysClockConfig(CKCU_SW_HSI);

  HT_CKCU->GCFGR = 0x00000102;                   /* Reset value of GCFGR                                    */
  HT_CKCU->GCCR = 0x00000803;                    /* Reset value of GCCR                                     */
  HT_CKCU->GCIR = 0x0000007D;                    /* Clear all interrupt flags                               */
  HT_CKCU->PLLCFGR = 0;                          /* Reset value of PLLCFGR                                  */
  HT_CKCU->PLLCR = 0;                            /* Reset value of PLLCR                                    */
  HT_CKCU->AHBCFGR = 0;                          /* Reset value of AHBCFGR                                  */
  HT_CKCU->AHBCCR = 0x000000E5;                  /* Reset value of AHBCCR                                   */
  HT_CKCU->APBCFGR = 0x00010000;                 /* Reset value of APBCFGR                                  */
  HT_CKCU->APBCCR0 = 0;                          /* Reset value of APBCCR0                                  */
  HT_CKCU->APBCCR1 = 0;                          /* Reset value of APBCCR1                                  */
  HT_CKCU->APBPCSR0 = 0;                         /* Reset value of APBPCSR0                                 */
  HT_CKCU->APBPCSR1 = 0;                         /* Reset value of APBPCSR1                                 */
  HT_CKCU->HSICR = 0;                            /* Reset value of HSICR                                    */
  HT_CKCU->HSIATCR = 0;                          /* Reset value of HSIATCR                                  */
  HT_CKCU->LPCR = 0;                             /* Reset value of LPCR                                     */
  HT_CKCU->MCUDBGCR = 0;                         /* Reset value of MCUDBGCR                                 */
}

