Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_ckcu.c
/*********************************************************************************************************//**
 * @brief Configure the CK_REF prescaler.
 * @param CKREFPRE: CKCU_CKREFPRE_DIV2 ~ CKCU_CKREFPRE_DIV64 (CK_REF = CK_PLL / 2N)
 * @retval None
 ************************************************************************************************************/
void CKCU_SetCKREFPrescaler(CKCU_CKREFPRE_TypeDef CKREFPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_CKREFPRE, CKCU_POS_CKREFPRE, CKREFPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the CK_USB prescaler.
 * @param USBPRE: specify the value of divider.
 *        This parameter can be:
 *        @arg CKCU_USBPRE_DIV1: CK_USB = CK_PLL / 1
 *        @arg CKCU_USBPRE_DIV2: CK_USB = CK_PLL / 2
 * @retval None
 ************************************************************************************************************/
void CKCU_SetUSBPrescaler(CKCU_USBPRE_TypeDef USBPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_USBPRE, CKCU_POS_USBPRE, USBPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the CK_ADC prescaler.
 * @param ADCPRE: specify the prescaler value.
 *        This parameter can be:
 *        @arg CKCU_ADCPRE_DIV2 : CK_ADC = HCLK / 2
 *        @arg CKCU_ADCPRE_DIV4 : CK_ADC = HCLK / 4
 *        @arg CKCU_ADCPRE_DIV6 : CK_ADC = HCLK / 6
 *        @arg CKCU_ADCPRE_DIV8 : CK_ADC = HCLK / 8
 *        @arg CKCU_ADCPRE_DIV16: CK_ADC = HCLK / 16
 *        @arg CKCU_ADCPRE_DIV32: CK_ADC = HCLK / 32
 *        @arg CKCU_ADCPRE_DIV64: CK_ADC = HCLK / 64
 * @retval None
 ************************************************************************************************************/
void CKCU_SetADCPrescaler(CKCU_ADCPRE_TypeDef ADCPRE)
{
  CKCU_BF_WRITE(HT_CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV, ADCPRE);
}

/*********************************************************************************************************//**
 * @brief Return the frequency of the different clocks.
 * @param CKCU_Clk: pointer to CKCU_ClocksTypeDef structure to get the clocks frequency.
 * @retval None
 ************************************************************************************************************/
void CKCU_GetClocksFrequency(CKCU_ClocksTypeDef* CKCU_Clk)
{
  u32 div;
  #ifdef HT32F12366_D11
  u32 SystemCoreClockSrc = (HT_CKCU->CKST >> 30) & 3UL;
  #else
  u32 SystemCoreClockSrc = (HT_CKCU->CKST >>  0) & 7UL;
  #endif

  CKCU_Clk->PLL_Freq = CKCU_GetPLLFrequency();

  /* Get system frequency                                                                                   */
  switch (SystemCoreClockSrc)
  {
    case CKCU_SW_PLL:
      CKCU_Clk->SYSCK_Freq = CKCU_Clk->PLL_Freq;
      break;
    case CKCU_SW_HSE:
      CKCU_Clk->SYSCK_Freq = HSE_VALUE;
      break;
    case CKCU_SW_HSI:
      CKCU_Clk->SYSCK_Freq = HSI_VALUE;
      break;
    default:
      CKCU_Clk->SYSCK_Freq = 0;
      break;
  }

  /* Get HCLK frequency                                                                                     */
  CKCU_Clk->HCLK_Freq = (CKCU_Clk->SYSCK_Freq) >> (HT_CKCU->AHBCFGR);

  /* Get ADC frequency                                                                                      */
  div = CKCU_BF_READ(HT_CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV);
  if (div == 7)
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) / 6;
  }
  else
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) >> div;
  }
}

/*********************************************************************************************************//**
 * @brief Return the frequency of the PLL.
 * @retval PLL Frequency
 ************************************************************************************************************/
u32 CKCU_GetPLLFrequency(void)
{
  u32 pllNO, pllNF, ClockSrc;

  /* Get PLL frequency                                                                                      */
  if (CKCU_BB_PLLEN == DISABLE)
  {
    return 0;
  }

  ClockSrc = (CKCU_BB_PLLSRC == CKCU_PLLSRC_HSE) ? HSE_VALUE : HSI_VALUE;

  if (CKCU_BB_PLLBYPASS == ENABLE)
  {
    return ClockSrc;
  }

  pllNF = CKCU_BF_READ(HT_CKCU->PLLCFGR, CKCU_MASK_PFBD, CKCU_POS_PFBD);
  if (pllNF == 0)
    pllNF = 64;

  pllNO = CKCU_BF_READ(HT_CKCU->PLLCFGR, CKCU_MASK_POTD, CKCU_POS_POTD);
  pllNO = (u8)0x1 << pllNO;

  return ((ClockSrc / pllNO) * pllNF);
}

/*********************************************************************************************************//**
 * @brief Configure the APB peripheral prescaler.
 * @param Perip: specify the APB peripheral.
 *        This parameter can be:
 *        @arg CKCU_PCLK_I2C0,  CKCU_PCLK_I2C1,  CKCU_PCLK_SPI0,   CKCU_PCLK_SPI1,
 *             CKCU_PCLK_BFTM0, CKCU_PCLK_BFTM1, CKCU_PCLK_MCTM0,  CKCU_PCLK_MCTM1,
 *             CKCU_PCLK_GPTM0, CKCU_PCLK_GPTM1, CKCU_PCLK_USART0, CKCU_PCLK_USART1,
 *             CKCU_PCLK_UART0, CKCU_PCLK_UART1
 *             CKCU_PCLK_AFIO,  CKCU_PCLK_EXTI,  CKCU_PCLK_ADC,    CKCU_PCLK_CMP,
 *             CKCU_PCLK_WDTR,  CKCU_PCLK_BKPR,  CKCU_PCLK_SCI,    CKCU_PCLK_I2S
 * @param PCLKPrescaler: specify the value of prescaler.
 *        This parameter can be:
 *        @arg CKCU_APBCLKPRE_DIV1:  specific peripheral clock = PCLK / 1  (inapplicable to BKPRCLK)
 *        @arg CKCU_APBCLKPRE_DIV2:  specific peripheral clock = PCLK / 2  (inapplicable to BKPRCLK)
 *        @arg CKCU_APBCLKPRE_DIV4:  specific peripheral clock = PCLK / 4
 *        @arg CKCU_APBCLKPRE_DIV8:  specific peripheral clock = PCLK / 8
 *        @arg CKCU_APBCLKPRE_DIV16: specific peripheral clock = PCLK / 16 (BKPRCLK only)
 *        @arg CKCU_APBCLKPRE_DIV32: specific peripheral clock = PCLK / 32 (BKPRCLK only)
 * @retval None
 ************************************************************************************************************/
void CKCU_SetPeripPrescaler(CKCU_PeripPrescaler_TypeDef Perip, CKCU_APBCLKPRE_TypeDef PCLKPrescaler)
{
  u32 *PCSR = (u32 *)((&HT_CKCU->APBPCSR0) + (Perip >> CKCU_APBPCSR_OFFSET));
  u32 Prescaler = PCLKPrescaler;
  if (Perip == CKCU_PCLK_BKPR)
  {
    Prescaler -= 2;
  }
  Perip -= 1 << CKCU_APBPCSR_OFFSET;
  CKCU_BF_WRITE(*PCSR, (3UL << Perip), Perip, Prescaler);
}

